---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LockOverconstrained
source: html/9fe588b5-a7ab-4336-be54-b0204317036d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LockOverconstrained Property

Locking this dimension would overconstrain the sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId LockOverconstrained { get; }
```